Autodesk.Revit.DB.Structure.BoundaryConditionsPreset
Specifies the type of boundary conditions preset.
Since:
2027
Since:
2027

Autodesk.Revit.DB.Structure.BoundaryConditionsPreset.User
User-defined boundary conditions preset.

Autodesk.Revit.DB.Structure.BoundaryConditionsPreset.Roller
Roller boundary conditions preset.

Autodesk.Revit.DB.Structure.BoundaryConditionsPreset.Pinned
Pinned boundary conditions preset.

Autodesk.Revit.DB.Structure.BoundaryConditionsPreset.Fixed
Fixed boundary conditions preset.